# Gradient Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient Class
Members See Also
---
A static class that provides access to the property names that appear in the Gradient visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Gradient
```

Visual Basic
---
```text
Public NotInheritable Class Gradient
```

Visual C++
---
```text
public ref class Gradient abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Gradient
# See Also
Gradient Members
Autodesk.Revit.DB.Visual Namespace